In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('Dataset/PersonalInfo.csv')
df.head()

   Sr_No      Name  Gender  Age       City
0      1  Rajendra    Male   40       Pune
1      2     Meena  Female   32  Hyderabad
2      3    Aarohi  Female   25       Pune
3      4     Aarav    Male   20     Mumbai
4      5   Aarushi  Female   12  Hyderabad

In [3]:
df.dtypes

Sr_No      int64
Name      object
Gender    object
Age        int64
City      object
dtype: object

In [4]:
# Change Data type during csv reading process
df = pd.read_csv('Dataset/PersonalInfo.csv',dtype={'Age':float})
df.head(3)

   Sr_No      Name  Gender   Age       City
0      1  Rajendra    Male  40.0       Pune
1      2     Meena  Female  32.0  Hyderabad
2      3    Aarohi  Female  25.0       Pune

In [5]:
df.dtypes

Sr_No       int64
Name       object
Gender     object
Age       float64
City       object
dtype: object

In [6]:
# Change data Types After csv Process.
df['Age'] = df['Age'].astype(int)
df.head(3)

   Sr_No      Name  Gender  Age       City
0      1  Rajendra    Male   40       Pune
1      2     Meena  Female   32  Hyderabad
2      3    Aarohi  Female   25       Pune